app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 48]]
---
                <%= link_to book_favorites_path(book), method: :delete do %>
                  ♥<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 49]]
---
                <%= link_to book_favorites_path(book), method: :post do %>
                  ♡<%= book.favorites.count %>

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 49]]
---
              </td>
              <td><p><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></p></td>