app/views/books/index.html.erb


              <td>コメント数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC